export interface Categories {
	[key: string]: string[]; // サブカテゴリの配列に簡略化
}

export const categories: Categories = {
	"家電・スマホ・カメラ": ["スマートフォン", "カメラ", "家電"],
	"ファッション・美容": ["メンズファッション", "レディースファッション", "美容・コスメ"],
	"本・音楽・ゲーム": ["本", "音楽", "ゲーム"],
	"スポーツ・レジャー": ["スポーツ用品", "アウトドア", "自転車"],
	"インテリア・住まい・小物": ["家具", "インテリア小物", "キッチン用品"],
	"DIY用品" : ["DIY小物類","ハードウェア ポンプ","フェンス・門","小型エンジン","工具","工具関連用品","建築材料","建築用消耗品","換気・空調","水道設備","燃料","燃料容器・タンク","貯蔵タンク","鍵","電力供給装置"
	],
	"おもちゃ・ゲーム": ["おもちゃ", "ゲーム","ゲームタイマー","パズル","屋外遊具",],
	"オフィス用品":["インパルスシーラー","オフィスマット・チェアマット","オフィスワゴン","オフィス機器","デスクマット","ネームプレート","ファイル・バインダー","プレゼン用品","ラップデスク","事務用品","事務用消耗品","書籍関連用品","書類整理","梱包用品"],
	"カメラ・光学機器":["カメラ","カメラ・光学機器アクセサリー","光学機器","写真関連用具"],
	"スポーツ用品":["エクササイズ・フィットネス","スポーツ競技","室内競技・室内ゲーム","屋外レクリエーション"],
	"ソフトウェア":["PCソフト","テレビゲームソフト","デジタルコンテンツ・仮想通貨"],
	"ビジネス・産業":["ピアス・タトゥー","ホテル・サービス業","医療","安全保護用品","小売業","広告・マーケティング","建築","映画・テレビ","林業・伐採","業務用ストレージ","歯科","清掃カート/バケツ","理容・美容","看板・標識","科学・実験","自動制御部品","製造","警察","農業","運搬","重機","金融・保険","鉱業・採石","飲食業"],
	"ファッション・アクセサリー":["コスチューム用品","ジュエリー","ハンドバッグ・財布","ファッション小物","衣料品","靴","靴用品"],
	"ベビー用品":["おくるみ用毛布","おむつ用品","トイレトレーニング","ベビーギフトセット","ベビー向けおもちゃ","ベビー用健康・衛生用品","ベビー用外出小物","ベビー用安全グッズ","授乳・離乳食","赤ちゃん入浴用品"],
	"ペット・ペット用品":["ペット","ペット用品"],
	"ホーム・ガーデン":["インテリア・エクステリア","ガーデン用品・ガーデン機器","キッチン・ダイニング","テーブルリネン・寝具","プール・スパ","傘・日傘","傘入れ・傘ケース","喫煙具","家電","家電関連用品","日用品","暖炉・薪ストーブ関連用品","植物","浴室・トイレ用品","照明","照明部品","薪ストーブ","防災機器（漏水・火災・ガス）","防災用品","防犯・セキュリティ"],
	"メディア":["DIY図面、木工図面","DVD・ビデオ","新聞・雑誌","書籍","製品マニュアル","音楽メディア"],
	"乗り物・パーツ":["乗り物","乗り物用パーツ・関連用品"],
	"冠婚葬祭・宗教":["宗教関連用具","結婚式用品","葬儀用品"],
	"家具":["オットマン","オフィス家具","ソファ","ソファ関連用品","テレビ台・オーディオラック","テーブル","テーブル関連用品","フトンソファ","ベッド・ベッド用品","ベビー用家具","ベンチ・スツール","ワゴン","収納家具","家具セット","屋外用家具","屋外用家具関連用品","敷き布団","棚・シェルフ関連用品","椅子","椅子関連用品","間仕切り・パーティション"],
	"旅行用かばん・バッグ":["ウェストポーチ・ヒップバッグ","エコバッグ・買い物バッグ","ガーメントバッグ","スーツケース","ダッフルバッグ","トレインケース","ドライボックス","バックパック","ブリーフケース","マザーズバッグ","メッセンジャーバッグ","旅行用かばん・バッグ関連用品","洗面化粧ポーチ"],
	"美容・健康":["ジュエリーお手入れ用品","ヘルスケア","衛生日用品"],
	"芸術・エンターテイメント":["イベント チケット","パーティー・お祝い","趣味・コレクション",],
	"電気製品":["ETC車載器","GPSアクセサリー","GPSトラッカー","GPSナビ","アーケードゲーム","オーディオ","ゲーム機関連用品","コンピューター","スピード ガン","テレビゲーム本体","ネットワーク","プリンター・コピー機","レーダー探知機","回路部品","映像","航海計器","通信機器","電子機器","電気製品関連用品・PC周辺機器"],
	"食品・飲料":["タバコ・喫煙具","食品","飲料"]
};